---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.SingleServerService
source: html/a8bb59ae-4b28-cfd4-757a-927e6cd3a428.htm
---
# SingleServerService Members

Registers a server with its service.